Repository: chaichaimee/uTubeDownload
Catalog: locale/*/LC_MESSAGES/nvda.po
Languages: es, fr, ru

source: File name cannot be empty
es: El nombre de archivo no puede estar vacío
fr: Le nom de fichier ne peut pas être vide
ru: Имя файла не может быть пустым

source: Download MP3 (single tap) or MP4 (double tap)
es: Descargar MP3 (un toque) o MP4 (doble toque)
fr: Télécharger MP3 (un seul toucher) ou MP4 (double toucher)
ru: Скачать MP3 (одно нажатие) или MP4 (двойное нажатие)

source: Download MP4
es: Descargar MP4
fr: Télécharger MP4
ru: Скачать MP4

source: Download MP3
es: Descargar MP3
fr: Télécharger MP3
ru: Скачать MP3

source: Open download folder
es: Abrir carpeta de descargas
fr: Ouvrir le dossier de téléchargement
ru: Открыть папку загрузок

source: Error opening folder
es: Error al abrir la carpeta
fr: Erreur lors de l'ouverture du dossier
ru: Ошибка при открытии папки

source: Invalid download folder
es: Carpeta de descarga no válida
fr: Dossier de téléchargement non valide
ru: Недопустимая папка для загрузки

source: Toggle playlist mode
es: Cambiar modo de lista de reproducción
fr: Basculer le mode playlist
ru: Переключить режим плейлиста

source: Playlist mode enabled
es: Modo de lista de reproducción habilitado
fr: Mode playlist activé
ru: Режим плейлиста включен

source: Playlist mode disabled
es: Modo de lista de reproducción deshabilitado
fr: Mode playlist désactivé
ru: Режим плейлиста отключен

source: uTubeTrim setting
es: Configuración de uTubeTrim
fr: Paramètres uTubeTrim
ru: Настройки uTubeTrim

source: Error: uTubeTrim module not available
es: Error: módulo uTubeTrim no disponible
fr: Erreur : module uTubeTrim non disponible
ru: Ошибка: модуль uTubeTrim недоступен

source: Error opening uTubeTrim dialog: {str(e)}
es: Error al abrir el diálogo de uTubeTrim: {str(e)}
fr: Erreur lors de l'ouverture de la boîte de dialogue uTubeTrim : {str(e)}
ru: Ошибка при открытии диалога uTubeTrim: {str(e)}

source: Error: uTubeSnapshot module not available
es: Error: módulo uTubeSnapshot no disponible
fr: Erreur : module uTubeSnapshot non disponible
ru: Ошибка: модуль uTubeSnapshot недоступен

source: Error importing core functions: {error}
es: Error al importar las funciones principales: {error}
fr: Erreur lors de l'importation des fonctions de base : {error}
ru: Ошибка при импорте основных функций: {error}

source: Error initializing uTubeDownload: {error}
es: Error al iniciar uTubeDownload: {error}
fr: Erreur lors de l'initialisation de uTubeDownload : {error}
ru: Ошибка при инициализации uTubeDownload: {error}

source: Cannot create folder
es: No se puede crear la carpeta
fr: Impossible de créer le dossier
ru: Невозможно создать папку

source: Found {count} interrupted downloads Resume all?
es: Se encontraron {count} descargas interrumpidas ¿Reanudar todas?
fr: {count} téléchargements interrompus trouvés Tout reprendre ?
ru: Найдено {count} прерванных загрузок Продолжить все?

source: Resume downloads
es: Reanudar descargas
fr: Reprendre les téléchargements
ru: Возобновить загрузки

source: Checking interrupted downloads...
es: Comprobando descargas interrumpidas...
fr: Vérification des téléchargements interrompus...
ru: Проверка прерванных загрузок...

source: Download complete
es: Descarga completa
fr: Téléchargement terminé
ru: Загрузка завершена

source: Download failed
es: Descarga fallida
fr: Échec du téléchargement
ru: Сбой загрузки

source: Download failed due to timeout
es: La descarga falló por tiempo de espera
fr: Le téléchargement a échoué en raison d'un délai d'attente
ru: Сбой загрузки из-за тайм-аута

source: Download failed due to an error
es: La descarga falló debido a un error
fr: Le téléchargement a échoué en raison d'une erreur
ru: Сбой загрузки из-за ошибки

source: Browser required
es: Se requiere un navegador
fr: Navigateur requis
ru: Требуется браузер

source: URL not found
es: URL no encontrada
fr: URL introuvable
ru: URL не найден

source: File exists
es: El archivo existe
fr: Le fichier existe
ru: Файл существует

source: yt-dlp.exe missing
es: Falta yt-dlp.exe
fr: yt-dlp.exe manquant
ru: Отсутствует yt-dlp.exe

source: Error: ffmpeg.exe not found.
es: Error: ffmpeg.exe no encontrado.
fr: Erreur : ffmpeg.exe introuvable.
ru: Ошибка: ffmpeg.exe не найден.

source: File already exists. Skipping download.
es: El archivo ya existe. Se omite la descarga.
fr: Le fichier existe déjà. Le téléchargement est ignoré.
ru: Файл уже существует. Пропуск загрузки.

source: No valid multimedia link found.
es: No se encontró ningún enlace multimedia válido.
fr: Aucun lien multimédia valide trouvé.
ru: Не найдено допустимых мультимедийных ссылок.

source: Adding link as {format} to download queue
es: Añadiendo enlace como {format} a la cola de descargas
fr: Ajout du lien au format {format} à la file d'attente de téléchargement
ru: Добавление ссылки в виде {format} в очередь загрузки

source: Not a YouTube video or valid multimedia link
es: No es un video de YouTube o un enlace multimedia válido
fr: Ce n'est pas une vidéo YouTube ou un lien multimédia valide
ru: Не является видео с YouTube или допустимой мультимедийной ссылкой

source: Destination folder
es: Carpeta de destino
fr: Dossier de destination
ru: Папка назначения

source: &Browse...
es: &Examinar...
fr: &Parcourir...
ru: &Обзор...

source: Select a directory
es: Seleccione un directorio
fr: Sélectionner un répertoire
ru: Выберите каталог

source: &Beep while converting
es: &Bip al convertir
fr: &Bip pendant la conversion
ru: &Звуковой сигнал при конвертации

source: &Say download complete
es: &Anunciar descarga completada
fr: &Annoncer la fin du téléchargement
ru: &Озвучить завершение загрузки

source: MP3 &quality (kbps):
es: Calidad de MP3 (kbps):
fr: Qualité MP3 (kbps) :
ru: Качество MP3 (кбит/с):

source: Use download section
es: Usar sección de descargas
fr: Utiliser la section de téléchargement
ru: Использовать раздел загрузки

source: &Number of connections:
es: &Número de conexiones:
fr: &Nombre de connexions :
ru: &Количество подключений:

source: Enable &playlist mode by default
es: Habilitar modo de lista de reproducción por defecto
fr: Activer le mode playlist par défaut
ru: Включить режим плейлиста по умолчанию

source: Skip existing files
es: Omitir archivos existentes
fr: Ignorer les fichiers existants
ru: Пропускать существующие файлы

source: Resume interrupted downloads on restart
es: Reanudar descargas interrumpidas al reiniciar
fr: Reprendre les téléchargements interrompus au redémarrage
ru: Возобновлять прерванные загрузки при перезапуске

source: Enable &logging
es: Habilitar registro
fr: Activer la journalisation
ru: Включить ведение журнала

source: Failed to create the specified folder. Please select a valid folder.
es: No se pudo crear la carpeta especificada. Por favor, seleccione una carpeta válida.
fr: Échec de la création du dossier spécifié. Veuillez sélectionner un dossier valide.
ru: Не удалось создать указанную папку. Выберите допустимую папку.

source: Error
fr: Erreur
ru: Ошибка

source: Error creating download folder
es: Error al crear la carpeta de descargas
fr: Erreur lors de la création du dossier de téléchargement
ru: Ошибка при создании папки загрузок

source: Snapshot file already exists
es: El archivo de instantánea ya existe
fr: Le fichier instantané existe déjà
ru: Файл моментального снимка уже существует

source: Capturing full-size snapshot...
es: Capturando instantánea de tamaño completo...
fr: Capture d'une image instantanée en taille réelle...
ru: Захват полноразмерного моментального снимка...

source: Downloading thumbnail...
es: Descargando miniatura...
fr: Téléchargement de la vignette...
ru: Загрузка миниатюры...

source: Processing snapshot...
es: Procesando instantánea...
fr: Traitement de l'image instantanée...
ru: Обработка моментального снимка...

source: Error: Failed to capture snapshot.
es: Error: No se pudo capturar la instantánea.
fr: Erreur : Échec de la capture de l'image instantanée.
ru: Ошибка: Не удалось захватить моментальный снимок.

source: Error: No snapshot file created.
es: Error: No se creó ningún archivo de instantánea.
fr: Erreur : Aucun fichier instantané créé.
ru: Ошибка: Файл моментального снимка не создан.

source: An unexpected error occurred.
es: Ocurrió un error inesperado.
fr: Une erreur inattendue s'est produite.
ru: Произошла непредвиденная ошибка.

source: Full-size snapshot complete
es: Instantánea de tamaño completo completada
fr: Image instantanée en taille réelle complète
ru: Полноразмерный моментальный снимок готов

source: Trimmed Clip
es: Clip recortado
fr: Clip rogné
ru: Обрезанный клип
